solver.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>solver</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="solver"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-02-08T11:40+0100"/>
<meta name="author" content="Graphenpraktikum"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">solver</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 catalan solver</a></li>
<li><a href="#sec-2">2 Rules</a>
<ul>
<li><a href="#sec-2-1">2.1 mark</a></li>
<li><a href="#sec-2-2">2.2 reattachExternal</a></li>
<li><a href="#sec-2-3">2.3 removeAttached</a></li>
<li><a href="#sec-2-4">2.4 removeR</a></li>
<li><a href="#sec-2-5">2.5 unmark</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Strategy</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> catalan solver</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>no <b>FAIL</b> label
</li>
<li>instead: <b>constraintAdj[id 0 op = count 3]</b> for mark rule
</li>
<li><a href="./solver-summary.pdf">rules pdf</a> and example 
</li>
<li><a href="./solver-shallow-grave.pdf">shallow grave pdf</a>
</li>
<li><a href="./solver-shallow-grave-path.pdf">shallow grave path pdf</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Rules</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> mark</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="example">mark = ruleGMLString("""
rule[
    ruleID "mark"
    left[
        node[id 0 label "0"]
        node[id 1 label "0"]
        node[id 2 label "0"]
        node[id 3 label "0"]       
    ]
    context[
        edge[source 0 target 1 label ""]
        edge[source 0 target 2 label ""]
        edge[source 0 target 3 label ""]
    ]
    right[
        node[id 0 label "A"]
        node[id 1 label "R"]
        node[id 2 label "R"]
        node[id 3 label "R"]               
    ]
    constrainAdj [
        id 0
        op = count 3
    ]
]
""")
</pre>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> reattachExternal</h3>
<div class="outline-text-3" id="text-2-2">




<pre class="example">reattachExternal = ruleGMLString("""
rule[
    ruleID "reattachExternal"
    left[
        edge[source 1 target 2 label ""]
    ]
    context[
        node[id 0 label "A"]
        node[id 1 label "0"]
        node[id 2 label "R"]
        node[id 3 label "R"]
        edge[source 0 target 2 label ""]
        edge[source 0 target 3 label ""]
    ]
    right[
        edge[source 1 target 0 label ""]
    ]
    constrainAdj[
        id 1
        op = count 0 nodeLabels [label "A"]
    ]
]
""")
</pre>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> removeAttached</h3>
<div class="outline-text-3" id="text-2-3">




<pre class="example">removeAttached = ruleGMLString("""
rule[
    ruleID "removeAttached"
    left[
        edge[source 1 target 2 label ""]
    ]
    context[
        node[id 0 label "A"]
        node[id 1 label "R"]
        node[id 2 label "R"]
        edge[source 0 target 1 label ""]
        edge[source 0 target 2 label ""]
    ]
    right[
    ]
]
""")
</pre>

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> removeR</h3>
<div class="outline-text-3" id="text-2-4">




<pre class="example">removeR = ruleGMLString("""
rule[
    ruleID "removeR"
    left[
        node[id 1 label "R"]
        node[id 2 label "R"]
        node[id 3 label "R"]
        edge[source 0 target 1 label ""]
        edge[source 0 target 2 label ""]
        edge[source 0 target 3 label ""]
    ]
    context[
        node[id 0 label "A"]
    ]
    right[
    ]
]
""")
</pre>

</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> unmark</h3>
<div class="outline-text-3" id="text-2-5">




<pre class="example">unmark = ruleGMLString("""
rule[
    ruleID "unmark"
    left[
        node[id 0 label "A"]
    ]
    context[
    ]
    right[
        node[id 0 label "0"]
    ]
]
""")
</pre>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Strategy</h2>
<div class="outline-text-2" id="text-3">




<pre class="example">strat1 = (
    addUniverse(LEVEL)
    &gt;&gt; addSubset(LEVEL)
    &gt;&gt; repeat(
        mark
        &gt;&gt; repeat(revive(reattachExternal))
        &gt;&gt; repeat(revive(removeAttached))
        &gt;&gt; repeat(revive(removeInterR))
        &gt;&gt; removeR
        &gt;&gt; unmark
    )
)
</pre>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2016-02-08T11:40+0100</p>
<p class="author">Author: Graphenpraktikum</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
